Revit 2026 API

# RoomTagRoom Property

---

The room that the tag is associated with.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Room Room { get; }
```
```vb
Public ReadOnly Property Room As Room
	Get
```
```cpp
public:
property Room^ Room {
	Room^ get ();
}
```
```fsharp
member Room : Room with get
```

#### Property Value

Room

In rare cases, the tag may not be associated to a room. The property will be  in these situations.

#### Reference

RoomTag Class

Autodesk.Revit.DB.Architecture Namespace